rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    m = Movie.find(params[:movie_id])
    @director = m.director
    puts "director", @director
    if  @director.nil? || @director.length ==0
      flash[:notice] = "Unfortunately '#{m.title}' has no director info"
      redirect_to root_path
    else
      @movies = Movie.where(:director => @director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "new title"], ["director", "new content"], ["updated_at", "2015-11-27 00:30:51.478651"], ["id", 1]]